# DataFrame for Indexing and Selection

- .loc vs .iloc: Use .loc for label-based indexing and .iloc for integer-based. Always prefer these over "chained indexing" (df[col][row]).

- Boolean Indexing: Filtering data based on conditions. 
```python 
df.loc[(df['age'] > 25) & (df['status'] == 'Active'), 'target_column']
```
- .query(): A cleaner, more readable way to filter data using a string expression. Itâ€™s often faster for large datasets.

In [1]:
import seaborn as sns
import pandas as pd
import numpy as np

df = sns.load_dataset('titanic')

df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [2]:
df.loc[(df['sex'] == 'male') & (df['age'] > 25), 'embark_town']

4      Southampton
6      Southampton
13     Southampton
20     Southampton
21     Southampton
          ...
881    Southampton
883    Southampton
886    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 274, dtype: object

In [3]:
df.query("sex == 'male' and age > 25")['embark_town']

4      Southampton
6      Southampton
13     Southampton
20     Southampton
21     Southampton
          ...
881    Southampton
883    Southampton
886    Southampton
889      Cherbourg
890     Queenstown
Name: embark_town, Length: 274, dtype: object

In [4]:
# row, column
val = df.iloc[0:5, :]
val

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True